<?xml version="1.0"?>
<GCC_XML version="0.9.0" cvs_revision="1.145">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11"/>
  <Typedef id="_2" name="__int128_t" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_15" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_16" context="_1" location="f0:0" file="f0" line="0"/>
  <Class id="_7" name="IVisitor" context="_1" location="f1:11" file="f1" line="11" members="_17 _18 _19 _20 _21" size="64" align="64"/>
  <Class id="_8" name="IExpr" context="_1" location="f1:3" file="f1" line="3" abstract="1" members="_22 _23 _24 _25 _26" size="64" align="64"/>
  <Class id="_9" name="AddExpr" context="_1" location="f1:7" file="f1" line="7" members="_27 _28 _29 _30 _31" bases="private:_8" size="64" align="64">
    <Base type="_8" access="private" virtual="0" offset="0"/>
  </Class>
  <Class id="_10" name="PrintingVisitor" context="_1" location="f1:15" file="f1" line="15" members="_32 _33 _34 _35 _36" bases="_7" size="64" align="64">
    <Base type="_7" access="public" virtual="0" offset="0"/>
  </Class>
  <Class id="_11" name="Config" context="_1" location="f1:19" file="f1" line="19" members="_37 _38 _39 _40 _41" size="8" align="8"/>
  <FundamentalType id="_12" name="__int128" size="128" align="128"/>
  <FundamentalType id="_13" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_14" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_42 _43 _44 _45" size="256" align="64"/>
  <PointerType id="_15" type="_46" size="64" align="64"/>
  <ArrayType id="_16" min="0" max="0" type="_47"/>
  <Method id="_17" name="visit_add_expr" returns="_48" context="_7" access="private" location="f1:12" file="f1" line="12" virtual="1" inline="1" mangled="_ZN8IVisitor14visit_add_exprEP7AddExpr">
    <Argument name="expr" type="_49" location="f1:12" file="f1" line="12"/>
  </Method>
  <OperatorMethod id="_18" name="=" returns="_50" context="_7" access="public" location="f1:11" file="f1" line="11" inline="1" artificial="1" mangled="_ZN8IVisitoraSERKS_">
    <Argument type="_51" location="f1:11" file="f1" line="11"/>
  </OperatorMethod>
  <Destructor id="_19" name="IVisitor" context="_7" access="public" location="f1:11" file="f1" line="11" inline="1" artificial="1"/>
  <Constructor id="_20" name="IVisitor" context="_7" access="public" location="f1:11" file="f1" line="11" inline="1" artificial="1"/>
  <Constructor id="_21" name="IVisitor" context="_7" access="public" location="f1:11" file="f1" line="11" inline="1" artificial="1">
    <Argument type="_51" location="f1:11" file="f1" line="11"/>
  </Constructor>
  <Method id="_22" name="accept" returns="_48" context="_8" access="private" location="f1:4" file="f1" line="4" virtual="1" pure_virtual="1" mangled="_ZN5IExpr6acceptEP8IVisitor">
    <Argument name="v" type="_52" location="f1:4" file="f1" line="4"/>
  </Method>
  <OperatorMethod id="_23" name="=" returns="_53" context="_8" access="public" location="f1:3" file="f1" line="3" inline="1" artificial="1" mangled="_ZN5IExpraSERKS_">
    <Argument type="_54" location="f1:3" file="f1" line="3"/>
  </OperatorMethod>
  <Destructor id="_24" name="IExpr" context="_8" access="public" location="f1:3" file="f1" line="3" inline="1" artificial="1"/>
  <Constructor id="_25" name="IExpr" context="_8" access="public" location="f1:3" file="f1" line="3" inline="1" artificial="1"/>
  <Constructor id="_26" name="IExpr" context="_8" access="public" location="f1:3" file="f1" line="3" inline="1" artificial="1">
    <Argument type="_54" location="f1:3" file="f1" line="3"/>
  </Constructor>
  <Method id="_27" name="accept" returns="_48" context="_9" access="private" location="f1:8" file="f1" line="8" virtual="1" overrides="_22" mangled="_ZN7AddExpr6acceptEP8IVisitor" attributes="override">
    <Argument name="v" type="_52" location="f1:8" file="f1" line="8"/>
  </Method>
  <OperatorMethod id="_28" name="=" returns="_55" context="_9" access="public" location="f1:7" file="f1" line="7" inline="1" artificial="1" mangled="_ZN7AddExpraSERKS_">
    <Argument type="_56" location="f1:7" file="f1" line="7"/>
  </OperatorMethod>
  <Destructor id="_29" name="AddExpr" context="_9" access="public" location="f1:7" file="f1" line="7" inline="1" artificial="1"/>
  <Constructor id="_30" name="AddExpr" context="_9" access="public" location="f1:7" file="f1" line="7" inline="1" artificial="1"/>
  <Constructor id="_31" name="AddExpr" context="_9" access="public" location="f1:7" file="f1" line="7" inline="1" artificial="1">
    <Argument type="_56" location="f1:7" file="f1" line="7"/>
  </Constructor>
  <Method id="_32" name="visit_add_expr" returns="_48" context="_10" access="private" location="f1:16" file="f1" line="16" virtual="1" overrides="_17" mangled="_ZN15PrintingVisitor14visit_add_exprEP7AddExpr" attributes="override">
    <Argument name="expr" type="_49" location="f1:16" file="f1" line="16"/>
  </Method>
  <OperatorMethod id="_33" name="=" returns="_57" context="_10" access="public" location="f1:15" file="f1" line="15" inline="1" artificial="1" mangled="_ZN15PrintingVisitoraSERKS_">
    <Argument type="_58" location="f1:15" file="f1" line="15"/>
  </OperatorMethod>
  <Destructor id="_34" name="PrintingVisitor" context="_10" access="public" location="f1:15" file="f1" line="15" inline="1" artificial="1"/>
  <Constructor id="_35" name="PrintingVisitor" context="_10" access="public" location="f1:15" file="f1" line="15" inline="1" artificial="1"/>
  <Constructor id="_36" name="PrintingVisitor" context="_10" access="public" location="f1:15" file="f1" line="15" inline="1" artificial="1">
    <Argument type="_58" location="f1:15" file="f1" line="15"/>
  </Constructor>
  <Method id="_37" name="get_server" returns="_48" context="_11" access="public" location="f1:21" file="f1" line="21" mangled="_ZN6Config10get_serverEv"/>
  <Constructor id="_38" name="Config" context="_11" access="public" location="f1:19" file="f1" line="19" inline="1" artificial="1"/>
  <Constructor id="_39" name="Config" context="_11" access="public" location="f1:19" file="f1" line="19" inline="1" artificial="1">
    <Argument type="_59" location="f1:19" file="f1" line="19"/>
  </Constructor>
  <OperatorMethod id="_40" name="=" returns="_60" context="_11" access="public" location="f1:19" file="f1" line="19" inline="1" artificial="1" mangled="_ZN6ConfigaSERKS_">
    <Argument type="_59" location="f1:19" file="f1" line="19"/>
  </OperatorMethod>
  <Destructor id="_41" name="Config" context="_11" access="public" location="f1:19" file="f1" line="19" inline="1" artificial="1"/>
  <Field id="_42" name="isa" type="_61" context="_14" access="public" offset="0"/>
  <Field id="_43" name="flags" type="_62" context="_14" access="public" offset="64"/>
  <Field id="_44" name="str" type="_63" context="_14" access="public" offset="128"/>
  <Field id="_45" name="length" type="_64" context="_14" access="public" offset="192"/>
  <Struct id="_47" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_65 _66 _67 _68" size="192" align="64"/>
  <FundamentalType id="_48" name="void" size="0" align="8"/>
  <PointerType id="_49" type="_9" size="64" align="64"/>
  <ReferenceType id="_50" type="_7" size="64" align="64"/>
  <ReferenceType id="_51" type="_7c" size="64" align="64"/>
  <CvQualifiedType id="_7c" type="_7" const="1"/>
  <PointerType id="_52" type="_7" size="64" align="64"/>
  <ReferenceType id="_53" type="_8" size="64" align="64"/>
  <ReferenceType id="_54" type="_8c" size="64" align="64"/>
  <CvQualifiedType id="_8c" type="_8" const="1"/>
  <ReferenceType id="_55" type="_9" size="64" align="64"/>
  <ReferenceType id="_56" type="_9c" size="64" align="64"/>
  <CvQualifiedType id="_9c" type="_9" const="1"/>
  <ReferenceType id="_57" type="_10" size="64" align="64"/>
  <ReferenceType id="_58" type="_10c" size="64" align="64"/>
  <CvQualifiedType id="_10c" type="_10" const="1"/>
  <ReferenceType id="_59" type="_11c" size="64" align="64"/>
  <CvQualifiedType id="_11c" type="_11" const="1"/>
  <ReferenceType id="_60" type="_11" size="64" align="64"/>
  <PointerType id="_61" type="_62c" size="64" align="64"/>
  <FundamentalType id="_62" name="int" size="32" align="32"/>
  <CvQualifiedType id="_62c" type="_62" const="1"/>
  <PointerType id="_63" type="_46c" size="64" align="64"/>
  <CvQualifiedType id="_46c" type="_46" const="1"/>
  <FundamentalType id="_64" name="long int" size="64" align="64"/>
  <Field id="_65" name="gp_offset" type="_69" context="_47" access="public" offset="0"/>
  <Field id="_66" name="fp_offset" type="_69" context="_47" access="public" offset="32"/>
  <Field id="_67" name="overflow_arg_area" type="_70" context="_47" access="public" offset="64"/>
  <Field id="_68" name="reg_save_area" type="_70" context="_47" access="public" offset="128"/>
  <FundamentalType id="_69" name="unsigned int" size="32" align="32"/>
  <PointerType id="_70" type="_48" size="64" align="64"/>
  <FundamentalType id="_46" name="char" size="8" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="foo.cpp"/>
</GCC_XML>
